//TODO: 1 ===================================
//Даний рядок, що складається із символів, наприклад, 'abcde'.
// Перевірте, що першим символом цього рядка є буква 'a'.
// Якщо це так - виведіть 'так', інакше виведіть 'ні'.

// const newString = 'abcde';
// function checkString(string) {
//     if (string.slice(0, 1) === 'a') {
//         return true;
//     } else {
//         return false;
//     }
// }
// console.log(checkString(newString));

// ___________________________________________________________________________________________________


//TODO: 2 ===================================
// У змінній min лежить число від 0 до 60. Визначте у котру чверть години
// Попадає це число (у першу, другу, третю або четверту). Виведіть значення у консоль, або alert
// const min = 45;

// const min = 45;

// function checkTime(min) {
//     if (min >= 0 && min <= 15) {
//         console.log("first");
//     } else if (min > 15 && min <= 30) {
//         console.log("second");
//     } else if (min > 30 && min <= 45) {
//         console.log("third");
//     } else if (min > 45 && min <= 60) {
//         console.log("fourth");
//     }
// }

// checkTime(min)


// _______________________________________________________________________________________________________________________________________+

//TODO: 3 ===================================
// Напиши скрипт, який отримує мінімальне та максимальне значення від користувача через prompt. Зроби перевірку, що користувач передає саме числа,
// якщо користувач водить не числа виведіть в консоль 'Будь ласка, введіть числа.'
// Також додайте перевірку, щоб користувач не зміг ввести мінімальне число > за максимальне,
// якщо це сталось виведи у консоль повідомлення 'Мінімальне значення повинно бути менше максимального.'.
// У випадку правильного ввода данних виведи у консоль рядок  "Випадкове число в діапазоні від мінімального до максимального : ("рандомне число")"

// const minValue = parseInt(prompt('Введіть мінімальне значення:'));
// const maxValue = parseInt(prompt('Введіть максимальне значення:'));
// function randomNumbers(min, max) {
//     if (isNaN(min) || isNaN(max)) {
//         console.log('Будь ласка, введіть числа.');
//     }
//     if (min > max) {
//         console.log('Мінімальне значення повинно бути менше максимального.');
//     }
//     if (max > min) {
//         let random = Math.floor(Math.random() * (max - min + 1)) + min;
//         alert(`Випадкове число в діапазоні від мінімального до максимального : ${random}`)
//     }

// }
// console.log(randomNumbers(minValue, maxValue));





// ____________________________________________________________________________________________________________________

//TODO: 4 ===================================
// Перевірити, чи є введене користувачем число парним чи непарним, і вивести відповідне повідомлення.
//Використай promt і виведи повідомлення в alert. (використати тернарний оператор)
// const userNumber = parseInt(prompt("Введіть число"));
// function checkNumber(number) {
//     if (number % 2 === 0) {
//         alert('парне число');
//     } else {
//         alert('непарне число');
//     }
// }

// checkNumber(userNumber)

// 'sdsad'.substring()


// _________________________________________________________________________________________________________________

//TODO: 5 ===================================
// Перепишіть if..else на тернарний оператор, за допомогою декількох операторів '?'.

// const login = undefined;
// let message = "";

// // if (login === 'Співробітник') {
// //   message = 'Привіт';
// // } else if (login == 'Директор') {
// //   message = 'Вітаю';
// // } else if (login == '') {
// //   message = 'Немає логіну';
// // } else {
// //   message = '';
// // }

// const login = 'Співробітник';

// function checkMessage(login) {
//     return message = login === 'Співробітник' ?  'Привіт' :
//               login === 'Директор' ?  'Вітаю':
//               login === '' ?  'Немає логіну' : '';
// }

// console.log(checkMessage(login));




// ___________________________________________________________________________________________________________

//TODO: 6 ===================================
// скористаємося циклом while та виведіть у консоль числа від 0 до 50
// let i = 0;



//  for (let i = 0; i <= 50; i += 1) {
//   console.log(i);
// }




// __________________________________________________________________________________________________________________

// TODO 7

// Дано число n = 1000.
//  Ділить його на 2 стільки разів, поки результат поділу не стане менше 50.
//  Яке число вийде?
//  Порахуйте кількість ітерацій, необхідних для цього, та запишіть його в змінну num.
// let n = 1000;
// let num = 0;

// 1.
// function calculate(number, pattern, divider) {
//     let n = number;
//     let num = 0;
//     while (n / divider > pattern) {
//         n /= divider;
//         num++;
//     }
//     return num;
// }
//  console.log(calculate(1000,10,4))


// 2.
// function calculate(number) {
//     let n = number;
//     let num = 0;
//     for (; n / 2 > 50; num++) {
//         n /= 2;
//         console.log(num);
//     }
//     return num;
// }
// console.log(calculate(1000))

// ___________________________________________________________________________________________________

//TODO: 8 ===================================
// При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа триває до того часу,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число,
// а не довільний набір символів, не потрібно.

// alert(`Загальна сума введених чисел дорівнює ${total}.`);

// let total = parseFloat(prompt("Введіть число"));
// let sum = total;
// if (isNaN(total)) {
//         alert(`Bye bye`);
//     }

// while (!isNaN(total)) {
//     let a = parseFloat(prompt("Введіть число"));
//     if (isNaN(a)) {
//         alert(`Загальна сума введених чисел дорівнює ${sum}.`);
//     } else {
//         sum += a;
//     }
// }


// _________________________________________________________________________________________________________________

// TODO: 9 ===================================
// Напишіть цикл, який пропонує ввести
// число більше 100 через prompt.
// Якщо відвідувач ввів інше число - попросити
// ввести ще раз і так далі.
// Цикл має питати число, поки відвідувач не
// введе число більше 100, або натисне кнопку
// скасування в prompt

// let number;

// do {
//     number = parseFloat(prompt("write number more 100"));
// } while (number < 100 || isNaN(number));

// ________________________________________________________________________________________________________

//TODO: 10 ===================================
//Напишіть цикл, який виводить у консоль
// числа від max до min за спаданням
// Додайте усі парні числа від min до max

// let max = 10;
// let min = 5;
// let total = 0;

// for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//         total += i;
//     }
// }


// console.log(`Сума усіх парних: ${total}`);

// ____________________________________________________________________________________________________________

//TODO: 11 ===================================
//  Виведіть методом console.log() зірочки від 1 до 7 штук у вигляді трикутника таким чино
// *
// **
// ***
// ****
// *****
// let star = "";
// let min = 1;
// let max = 7;

// for (let i = min; i <= max; i++) {
//     console.log(star = star + '*');
// }

// ________________________________________________________________________________________________________________

//TODO: 12 ===================================
//Якщо число ділитися на 3 повертати
//fizz якщо ділитися на 5 повертати buzz
//Якщо ділитися на 3 і на 5 повернути fizzbuzz

// const userNumber = 6;
// if (userNumber % 3 === 0 && userNumber % 5 === 0) {
//     console.log("fizzbuss");
// } else if (userNumber % 3 === 0) {
//     console.log("fizz");
// } else if (userNumber % 5 === 0) {
//     console.log("buzz");
// } else {
//     console.log("false");
// }

// ______________________________________________________________________________________

//TODO: 13 ===================================
// Змінна num може набувати 4 значення: 1, 2, 3 або 4. Якщо вона має
// значення '1', то у змінну result запишемо 'зима', якщо має значення
// '2' - 'весна' і так далі. Розв'яжіть завдання через switch-case.

// let num = 2;
// let result;

// switch (num) {
//     case 1:
//         result = "winter";
//         break;
//     case 2:
//         result = "spring";
//         break;
//     case 3:
//         result = "summer";
//         break;
//     case 4:
//         result = "autemn";
//         break;
// }

// console.log(result)

// _________________________________________________________________________________________________________

//TODO: 14 ===================================
// Напишіть if..else, що відповідає наступному switch:

const browser = 'dfnkjd';

// switch (browser) {
//   case 'Edge':
//     console.log("You've got the Edge!");
//     break;

//   case 'Chrome':
//   case 'Firefox':
//   case 'Safari':
//   case 'Opera':
//     console.log('Okay we support these browsers too');
//     break;

//   default:
//     console.log('We hope that this page looks ok!');
// }

// if (browser === "Edge") {
//     console.log("You've got the Edge!");
// } else if (browser === "Chrome" || browser === "Firefox" || browser === "Safari" || browser === "Opera") {
//     console.log('Okay we support these browsers too');
// } else {
//     console.log('We hope that this page looks ok!');
// }

